docs/result.txt


[OnvifServer] Active namespaces:
  SOAP-ENV -> http://www.w3.org/2003/05/soap-envelope
  SOAP-ENC -> http://www.w3.org/2003/05/soap-encoding
  xsi -> http://www.w3.org/2001/XMLSchema-instance
  xsd -> http://www.w3.org/2001/XMLSchema
  wsa5 -> http://www.w3.org/2005/08/addressing
  wsse -> http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd
  wsu -> http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd
  wsdd -> http://docs.oasis-open.org/ws-dd/ns/discovery/2009/01
  tt -> http://www.onvif.org/ver10/schema
  tds -> http://www.onvif.org/ver10/device/wsdl
  tr2 -> http://www.onvif.org/ver20/media/wsdl
  tptz -> http://www.onvif.org/ver20/ptz/wsdl
  timg -> http://www.onvif.org/ver20/imaging/wsdl
  tev -> http://www.onvif.org/ver10/events/wsdl
  tan -> http://www.onvif.org/ver20/analytics/wsdl
  tdn -> http://www.onvif.org/ver10/network/wsdl
  wsnt -> http://docs.oasis-open.org/wsn/b-2
  ter -> http://www.onvif.org/ver10/error
  ter -> http://www.onvif.org/ver10/error
[OnvifServer] Listening on port 8080
[DEBUG RECV] POST /onvif/device_service HTTP/1.1
Host: 192.168.254.119:8080
Content-Type: application/soap+xml; charset=utf-8
Content-Length: 347

<?xml version="1.0" encoding="utf-8"?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><GetServices xmlns="http://www.onvif.org/ver10/device/wsdl"><IncludeCapability>false</IncludeCapability></GetServices></s:Body></s:Envelope>
[DEBUG SEND] HTTP/1.1 200 OK
Server: gSOAP/2.8
X-Frame-Options: SAMEORIGIN
Content-Type: application/soap+xml; charset=utf-8
Content-Length: 2674
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:saml1="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:wsc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex" xmlns:wsdd10="http://tempuri.org/wsdd10.xsd" xmlns:wsa5="http://www.w3.org/2005/08/addressing" xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2" xmlns:ns2="http://www.onvif.org/ver20/analytics/humanface" xmlns:ns3="http://www.onvif.org/ver20/analytics/humanbody" xmlns:xmime="http://tempuri.org/xmime.xsd" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2" xmlns:wstop="http://docs.oasis-open.org/wsn/t-1" xmlns:ns1="http://www.onvif.org/ver20/media/wsdl" xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl" xmlns:tdn="http://www.onvif.org/ver10/network/wsdl" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:tev="http://www.onvif.org/ver10/events/wsdl" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl" xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"><SOAP-ENV:Body><tds:GetServicesResponse><tds:Service><tds:Namespace>http://www.onvif.org/ver10/device/wsdl</tds:Namespace><tds:XAddr>http://192.168.254.119:8080/onvif/device</tds:XAddr><tds:Version><tt:Major>21</tt:Major><tt:Minor>12</tt:Minor></tds:Version></tds:Service><tds:Service><tds:Namespace>http://www.onvif.org/ver20/media/wsdl</tds:Namespace><tds:XAddr>http://192.168.254.119:8080/onvif/media</tds:XAddr><tds:Version><tt:Major>20</tt:Major><tt:Minor>12</tt:Minor></tds:Version></tds:Service><tds:Service><tds:Namespace>http://www.onvif.org/ver10/events/wsdl</tds:Namespace><tds:XAddr>http://192.168.254.119:8080/onvif/event</tds:XAddr><tds:Version><tt:Major>21</tt:Major><tt:Minor>12</tt:Minor></tds:Version></tds:Service></tds:GetServicesResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>

[DEBUG RECV] POST /onvif/media HTTP/1.1
Host: 192.168.254.119:8080
Content-Type: application/soap+xml; charset=utf-8
Content-Length: 351

<?xml version="1.0" encoding="utf-8"?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><GetProfiles xmlns="http://www.onvif.org/ver20/media/wsdl"><Type>VideoSource</Type><Type>VideoEncoder</Type></GetProfiles></s:Body></s:Envelope>
[DigestAuth] Missing Authorization header
[DEBUG SEND]
[DEBUG SEND] HTTP/1.1 401 Unauthorized
WWW-Authenticate: Basic realm="gSOAP Web Service"
Server: gSOAP/2.8
X-Frame-Options: SAMEORIGIN
Content-Type: application/soap+xml; charset=utf-8
Content-Length: 0
WWW-Authenticate: Digest realm="onvif", qop="auth", nonce="a390075166634a1f233b9092dad62fcb", opaque="15c7e1d555c8869ab831b5ed17007606"
Connection: close


[DEBUG RECV] POST /onvif/media HTTP/1.1
Host: 192.168.254.119:8080
Content-Type: application/soap+xml; charset=utf-8
Authorization: Digest username="admin",realm="onvif",qop="auth",algorithm=MD5,uri="/onvif/media",nonce="a390075166634a1f233b9092dad62fcb",nc=00000001,cnonce="14E1B1F39475D8BF16AF0B38625F1490",opaque="15c7e1d555c8869ab831b5ed17007606",response="1c67671dab8a11f1d34b78604e6d6e3b"
Content-Length: 351

<?xml version="1.0" encoding="utf-8"?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><GetProfiles xmlns="http://www.onvif.org/ver20/media/wsdl"><Type>VideoSource</Type><Type>VideoEncoder</Type></GetProfiles></s:Body></s:Envelope>
[Media2Service] GetProfiles → 3 profiles
[DEBUG SEND] HTTP/1.1 200 OK
Server: gSOAP/2.8
X-Frame-Options: SAMEORIGIN
Content-Type: application/soap+xml; charset=utf-8
Content-Length: 4319
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:saml1="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:wsc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex" xmlns:wsdd10="http://tempuri.org/wsdd10.xsd" xmlns:wsa5="http://www.w3.org/2005/08/addressing" xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2" xmlns:ns2="http://www.onvif.org/ver20/analytics/humanface" xmlns:ns3="http://www.onvif.org/ver20/analytics/humanbody" xmlns:xmime="http://tempuri.org/xmime.xsd" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2" xmlns:wstop="http://docs.oasis-open.org/wsn/t-1" xmlns:ns1="http://www.onvif.org/ver20/media/wsdl" xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl" xmlns:tdn="http://www.onvif.org/ver10/network/wsdl" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:tev="http://www.onvif.org/ver10/events/wsdl" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl" xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"><SOAP-ENV:Body><ns1:GetProfilesResponse><ns1:Profiles token="profile_main"><ns1:Name>Main 4K</ns1:Name><ns1:Configurations><ns1:VideoSource token="video_source_config"><tt:Name>VideoSourceConfig</tt:Name><tt:UseCount>0</tt:UseCount><tt:SourceToken>src_main</tt:SourceToken><tt:Bounds xsi:type="tt:IntRectangle" x="0" y="0" width="1920" height="1080"></tt:Bounds></ns1:VideoSource><ns1:VideoEncoder token="video_encoder_config"><tt:Name>VideoEncoderConfig</tt:Name><tt:UseCount>0</tt:UseCount><tt:Encoding>H264</tt:Encoding><tt:Resolution><tt:Width>3840</tt:Width><tt:Height>2160</tt:Height></tt:Resolution><tt:RateControl><tt:FrameRateLimit>30</tt:FrameRateLimit><tt:BitrateLimit>20000</tt:BitrateLimit></tt:RateControl><tt:Quality>50</tt:Quality></ns1:VideoEncoder></ns1:Configurations></ns1:Profiles><ns1:Profiles token="profile_sub1"><ns1:Name>Sub1 1080p</ns1:Name><ns1:Configurations><ns1:VideoSource token="video_source_config"><tt:Name>VideoSourceConfig</tt:Name><tt:UseCount>0</tt:UseCount><tt:SourceToken>src_sub1</tt:SourceToken><tt:Bounds xsi:type="tt:IntRectangle" x="0" y="0" width="1920" height="1080"></tt:Bounds></ns1:VideoSource><ns1:VideoEncoder token="video_encoder_config_profile_sub1"><tt:Name>VideoEncoderConfig_profile_sub1</tt:Name><tt:UseCount>0</tt:UseCount><tt:Encoding>H264</tt:Encoding><tt:Resolution><tt:Width>1920</tt:Width><tt:Height>1080</tt:Height></tt:Resolution><tt:RateControl><tt:FrameRateLimit>15</tt:FrameRateLimit><tt:BitrateLimit>4000</tt:BitrateLimit></tt:RateControl><tt:Quality>50</tt:Quality></ns1:VideoEncoder></ns1:Configurations></ns1:Profiles><ns1:Profiles token="profile_sub2"><ns1:Name>Sub2 480p</ns1:Name><ns1:Configurations><ns1:VideoSource token="video_source_config"><tt:Name>VideoSourceConfig</tt:Name><tt:UseCount>0</tt:UseCount><tt:SourceToken>src_sub2</tt:SourceToken><tt:Bounds xsi:type="tt:IntRectangle" x="0" y="0" width="1920" height="1080"></tt:Bounds></ns1:VideoSource><ns1:VideoEncoder token="video_encoder_config_profile_sub2"><tt:Name>VideoEncoderConfig_profile_sub2</tt:Name><tt:UseCount>0</tt:UseCount><tt:Encoding>H265</tt:Encoding><tt:Resolution><tt:Width>640</tt:Width><tt:Height>480</tt:Height></tt:Resolution><tt:RateControl><tt:FrameRateLimit>10</tt:FrameRateLimit><tt:BitrateLimit>512</tt:BitrateLimit></tt:RateControl><tt:Quality>50</tt:Quality></ns1:VideoEncoder></ns1:Configurations></ns1:Profiles></ns1:GetProfilesResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>

[DEBUG RECV] POST /onvif/media HTTP/1.1
Host: 192.168.254.119:8080
Content-Type: application/soap+xml; charset=utf-8
Authorization: Digest username="admin",realm="onvif",qop="auth",algorithm=MD5,uri="/onvif/media",nonce="a390075166634a1f233b9092dad62fcb",nc=00000002,cnonce="6889AE47FF2BAEA1171E4F4298A68B54",opaque="15c7e1d555c8869ab831b5ed17007606",response="18ac6966508cb482f9407420c6d929a9"
Content-Length: 452

<?xml version="1.0" encoding="utf-8"?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><GetVideoEncoderConfigurationOptions xmlns="http://www.onvif.org/ver20/media/wsdl"><ConfigurationToken>video_encoder_config</ConfigurationToken><ProfileToken>profile_main</ProfileToken></GetVideoEncoderConfigurationOptions></s:Body></s:Envelope>
[WsSecurity] Auth failed: No SOAP header
[OnvifServer] Error processing SOAP request:
SOAP 1.2 fault SOAP-ENV:Sender [ter:NotAuthorized]
"Sender"
Detail: Not Authorized
[DEBUG SEND] HTTP/1.1 400 Bad Request
Server: gSOAP/2.8
X-Frame-Options: SAMEORIGIN
Content-Type: application/soap+xml; charset=utf-8
Content-Length: 2264
Connection: close

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:saml1="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:wsc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex" xmlns:wsdd10="http://tempuri.org/wsdd10.xsd" xmlns:wsa5="http://www.w3.org/2005/08/addressing" xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2" xmlns:ns2="http://www.onvif.org/ver20/analytics/humanface" xmlns:ns3="http://www.onvif.org/ver20/analytics/humanbody" xmlns:xmime="http://tempuri.org/xmime.xsd" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2" xmlns:wstop="http://docs.oasis-open.org/wsn/t-1" xmlns:ns1="http://www.onvif.org/ver20/media/wsdl" xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl" xmlns:tdn="http://www.onvif.org/ver10/network/wsdl" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:tev="http://www.onvif.org/ver10/events/wsdl" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl" xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"><SOAP-ENV:Body><SOAP-ENV:Fault><SOAP-ENV:Code><SOAP-ENV:Value>SOAP-ENV:Sender</SOAP-ENV:Value><SOAP-ENV:Subcode><SO